; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=414, out_folder=./training, instance_id=98, seed=2122, goal_proportion=0.03

(define (problem blocksworld-98)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 b340 b341 b342 b343 b344 b345 b346 b347 b348 b349 b350 b351 b352 b353 b354 b355 b356 b357 b358 b359 b360 b361 b362 b363 b364 b365 b366 b367 b368 b369 b370 b371 b372 b373 b374 b375 b376 b377 b378 b379 b380 b381 b382 b383 b384 b385 b386 b387 b388 b389 b390 b391 b392 b393 b394 b395 b396 b397 b398 b399 b400 b401 b402 b403 b404 b405 b406 b407 b408 b409 b410 b411 b412 b413 b414 - object)
 (:init 
    (arm-empty)
    (clear b99)
    (on b99 b108)
    (on b108 b323)
    (on b323 b268)
    (on b268 b398)
    (on-table b398)
    (clear b235)
    (on b235 b254)
    (on b254 b70)
    (on b70 b105)
    (on b105 b265)
    (on b265 b352)
    (on b352 b159)
    (on-table b159)
    (clear b9)
    (on b9 b362)
    (on-table b362)
    (clear b145)
    (on b145 b257)
    (on-table b257)
    (clear b409)
    (on-table b409)
    (clear b152)
    (on b152 b369)
    (on-table b369)
    (clear b179)
    (on b179 b292)
    (on-table b292)
    (clear b211)
    (on b211 b302)
    (on b302 b413)
    (on b413 b248)
    (on b248 b349)
    (on-table b349)
    (clear b112)
    (on-table b112)
    (clear b206)
    (on b206 b355)
    (on b355 b198)
    (on b198 b337)
    (on b337 b3)
    (on b3 b41)
    (on b41 b214)
    (on-table b214)
    (clear b100)
    (on b100 b74)
    (on b74 b387)
    (on-table b387)
    (clear b156)
    (on b156 b351)
    (on b351 b120)
    (on b120 b368)
    (on-table b368)
    (clear b33)
    (on b33 b149)
    (on b149 b399)
    (on b399 b391)
    (on b391 b139)
    (on b139 b91)
    (on b91 b116)
    (on b116 b162)
    (on b162 b184)
    (on-table b184)
    (clear b135)
    (on b135 b305)
    (on-table b305)
    (clear b250)
    (on b250 b177)
    (on b177 b408)
    (on-table b408)
    (clear b261)
    (on b261 b31)
    (on b31 b310)
    (on-table b310)
    (clear b288)
    (on-table b288)
    (clear b243)
    (on b243 b165)
    (on b165 b141)
    (on b141 b23)
    (on-table b23)
    (clear b94)
    (on-table b94)
    (clear b110)
    (on-table b110)
    (clear b240)
    (on-table b240)
    (clear b113)
    (on-table b113)
    (clear b326)
    (on-table b326)
    (clear b374)
    (on b374 b358)
    (on b358 b5)
    (on b5 b340)
    (on-table b340)
    (clear b88)
    (on-table b88)
    (clear b321)
    (on b321 b195)
    (on b195 b286)
    (on-table b286)
    (clear b148)
    (on b148 b383)
    (on b383 b280)
    (on b280 b274)
    (on b274 b218)
    (on b218 b264)
    (on b264 b357)
    (on b357 b312)
    (on b312 b238)
    (on b238 b411)
    (on-table b411)
    (clear b371)
    (on-table b371)
    (clear b181)
    (on b181 b16)
    (on-table b16)
    (clear b52)
    (on b52 b329)
    (on b329 b161)
    (on-table b161)
    (clear b255)
    (on b255 b372)
    (on-table b372)
    (clear b396)
    (on b396 b26)
    (on-table b26)
    (clear b117)
    (on b117 b178)
    (on b178 b410)
    (on b410 b169)
    (on b169 b344)
    (on-table b344)
    (clear b2)
    (on b2 b17)
    (on b17 b196)
    (on b196 b204)
    (on b204 b50)
    (on b50 b69)
    (on b69 b18)
    (on-table b18)
    (clear b363)
    (on b363 b278)
    (on b278 b20)
    (on-table b20)
    (clear b157)
    (on-table b157)
    (clear b194)
    (on b194 b29)
    (on b29 b406)
    (on b406 b237)
    (on-table b237)
    (clear b209)
    (on b209 b338)
    (on-table b338)
    (clear b173)
    (on-table b173)
    (clear b186)
    (on b186 b258)
    (on-table b258)
    (clear b51)
    (on b51 b132)
    (on-table b132)
    (clear b266)
    (on b266 b182)
    (on-table b182)
    (clear b322)
    (on-table b322)
    (clear b291)
    (on b291 b163)
    (on b163 b63)
    (on b63 b80)
    (on-table b80)
    (clear b92)
    (on b92 b331)
    (on b331 b87)
    (on b87 b246)
    (on b246 b192)
    (on b192 b143)
    (on b143 b158)
    (on b158 b213)
    (on b213 b309)
    (on b309 b81)
    (on b81 b72)
    (on b72 b271)
    (on b271 b365)
    (on b365 b217)
    (on-table b217)
    (clear b97)
    (on b97 b239)
    (on-table b239)
    (clear b28)
    (on b28 b118)
    (on b118 b34)
    (on-table b34)
    (clear b318)
    (on b318 b270)
    (on-table b270)
    (clear b311)
    (on b311 b327)
    (on-table b327)
    (clear b233)
    (on b233 b103)
    (on b103 b122)
    (on b122 b285)
    (on b285 b68)
    (on b68 b64)
    (on-table b64)
    (clear b130)
    (on b130 b205)
    (on-table b205)
    (clear b262)
    (on b262 b281)
    (on b281 b212)
    (on b212 b71)
    (on b71 b203)
    (on-table b203)
    (clear b377)
    (on-table b377)
    (clear b62)
    (on b62 b7)
    (on-table b7)
    (clear b197)
    (on b197 b356)
    (on-table b356)
    (clear b42)
    (on b42 b307)
    (on b307 b44)
    (on-table b44)
    (clear b146)
    (on-table b146)
    (clear b14)
    (on b14 b299)
    (on-table b299)
    (clear b57)
    (on b57 b373)
    (on-table b373)
    (clear b231)
    (on-table b231)
    (clear b13)
    (on b13 b306)
    (on b306 b319)
    (on b319 b225)
    (on b225 b67)
    (on-table b67)
    (clear b22)
    (on b22 b313)
    (on b313 b222)
    (on b222 b272)
    (on-table b272)
    (clear b174)
    (on b174 b65)
    (on b65 b25)
    (on b25 b30)
    (on b30 b341)
    (on-table b341)
    (clear b56)
    (on b56 b380)
    (on b380 b245)
    (on-table b245)
    (clear b54)
    (on b54 b102)
    (on-table b102)
    (clear b308)
    (on-table b308)
    (clear b193)
    (on b193 b39)
    (on b39 b347)
    (on-table b347)
    (clear b171)
    (on b171 b343)
    (on b343 b129)
    (on b129 b133)
    (on b133 b333)
    (on b333 b405)
    (on b405 b95)
    (on b95 b121)
    (on b121 b298)
    (on b298 b190)
    (on b190 b219)
    (on b219 b353)
    (on b353 b160)
    (on-table b160)
    (clear b140)
    (on b140 b386)
    (on-table b386)
    (clear b339)
    (on b339 b153)
    (on-table b153)
    (clear b276)
    (on b276 b199)
    (on b199 b407)
    (on b407 b53)
    (on b53 b123)
    (on b123 b236)
    (on b236 b76)
    (on-table b76)
    (clear b345)
    (on-table b345)
    (clear b11)
    (on b11 b249)
    (on b249 b263)
    (on b263 b273)
    (on b273 b232)
    (on b232 b260)
    (on b260 b234)
    (on b234 b38)
    (on b38 b256)
    (on b256 b24)
    (on-table b24)
    (clear b183)
    (on b183 b126)
    (on b126 b332)
    (on-table b332)
    (clear b279)
    (on-table b279)
    (clear b61)
    (on b61 b127)
    (on b127 b47)
    (on b47 b297)
    (on b297 b394)
    (on b394 b382)
    (on b382 b221)
    (on b221 b223)
    (on b223 b314)
    (on b314 b315)
    (on-table b315)
    (clear b216)
    (on-table b216)
    (clear b134)
    (on b134 b82)
    (on b82 b168)
    (on b168 b147)
    (on b147 b210)
    (on-table b210)
    (clear b175)
    (on b175 b395)
    (on b395 b403)
    (on b403 b269)
    (on b269 b244)
    (on b244 b35)
    (on b35 b392)
    (on b392 b336)
    (on-table b336)
    (clear b19)
    (on b19 b77)
    (on b77 b138)
    (on-table b138)
    (clear b128)
    (on b128 b164)
    (on b164 b379)
    (on b379 b328)
    (on-table b328)
    (clear b131)
    (on b131 b32)
    (on b32 b6)
    (on b6 b346)
    (on b346 b301)
    (on b301 b397)
    (on-table b397)
    (clear b354)
    (on b354 b350)
    (on b350 b375)
    (on b375 b79)
    (on b79 b381)
    (on b381 b136)
    (on b136 b15)
    (on b15 b404)
    (on b404 b253)
    (on b253 b4)
    (on b4 b106)
    (on b106 b60)
    (on b60 b360)
    (on b360 b151)
    (on b151 b90)
    (on-table b90)
    (clear b335)
    (on b335 b401)
    (on b401 b393)
    (on b393 b124)
    (on b124 b55)
    (on b55 b21)
    (on b21 b208)
    (on b208 b400)
    (on-table b400)
    (clear b277)
    (on b277 b166)
    (on b166 b111)
    (on b111 b10)
    (on b10 b85)
    (on b85 b320)
    (on b320 b287)
    (on b287 b370)
    (on b370 b176)
    (on-table b176)
    (clear b83)
    (on b83 b109)
    (on b109 b303)
    (on b303 b8)
    (on b8 b342)
    (on b342 b119)
    (on-table b119)
    (clear b289)
    (on-table b289)
    (clear b364)
    (on b364 b389)
    (on b389 b366)
    (on b366 b304)
    (on-table b304)
    (clear b402)
    (on-table b402)
    (clear b330)
    (on b330 b188)
    (on-table b188)
    (clear b125)
    (on b125 b300)
    (on b300 b170)
    (on-table b170)
    (clear b27)
    (on b27 b251)
    (on-table b251)
    (clear b84)
    (on b84 b293)
    (on b293 b189)
    (on b189 b228)
    (on b228 b144)
    (on b144 b180)
    (on b180 b1)
    (on b1 b247)
    (on-table b247)
    (clear b75)
    (on b75 b89)
    (on b89 b290)
    (on b290 b46)
    (on b46 b414)
    (on b414 b220)
    (on b220 b317)
    (on b317 b295)
    (on b295 b215)
    (on b215 b191)
    (on-table b191)
    (clear b58)
    (on b58 b316)
    (on b316 b37)
    (on-table b37)
    (clear b230)
    (on b230 b390)
    (on b390 b359)
    (on b359 b283)
    (on b283 b367)
    (on b367 b154)
    (on b154 b275)
    (on b275 b59)
    (on b59 b86)
    (on-table b86)
    (clear b267)
    (on b267 b48)
    (on b48 b12)
    (on b12 b384)
    (on b384 b334)
    (on b334 b241)
    (on-table b241)
    (clear b296)
    (on-table b296)
    (clear b412)
    (on-table b412)
    (clear b137)
    (on-table b137)
    (clear b202)
    (on-table b202)
    (clear b252)
    (on b252 b114)
    (on b114 b284)
    (on b284 b167)
    (on-table b167)
    (clear b66)
    (on-table b66)
    (clear b73)
    (on b73 b172)
    (on-table b172)
    (clear b385)
    (on b385 b388)
    (on b388 b36)
    (on b36 b259)
    (on b259 b227)
    (on b227 b376)
    (on b376 b93)
    (on-table b93)
    (clear b45)
    (on b45 b242)
    (on-table b242)
    (clear b40)
    (on-table b40)
    (clear b142)
    (on-table b142)
    (clear b115)
    (on-table b115)
    (clear b96)
    (on b96 b101)
    (on b101 b104)
    (on b104 b226)
    (on-table b226)
    (clear b187)
    (on-table b187)
    (clear b207)
    (on b207 b78)
    (on b78 b200)
    (on b200 b324)
    (on b324 b348)
    (on-table b348)
    (clear b361)
    (on b361 b98)
    (on b98 b185)
    (on b185 b150)
    (on b150 b49)
    (on b49 b294)
    (on b294 b378)
    (on-table b378)
    (clear b325)
    (on b325 b224)
    (on-table b224)
    (clear b282)
    (on b282 b155)
    (on b155 b43)
    (on b43 b107)
    (on b107 b229)
    (on b229 b201)
    (on-table b201))
 (:goal  (and 
    (clear b6)
    (on b6 b10)
    (on b10 b8)
    (on b8 b2)
    (on b2 b7)
    (on b7 b3)
    (on-table b3)
    (clear b4)
    (on-table b4)
    (clear b5)
    (on b5 b9)
    (on b9 b12)
    (on-table b12)
    (clear b11)
    (on b11 b1)
    (on-table b1))))

; plan
1. (unstack b131 b32)
   deleted: (on b131 b32) (clear b131) (arm-empty)
   added: (holding b131) (clear b32)
   goals met: 1 of 16
2. (putdown b131)
   deleted: (holding b131)
   added: (clear b131) (arm-empty) (on-table b131)
   goals met: 1 of 16
3. (unstack b206 b355)
   deleted: (on b206 b355) (clear b206) (arm-empty)
   added: (holding b206) (clear b355)
   goals met: 1 of 16
4. (putdown b206)
   deleted: (holding b206)
   added: (clear b206) (arm-empty) (on-table b206)
   goals met: 1 of 16
5. (unstack b267 b48)
   deleted: (on b267 b48) (clear b267) (arm-empty)
   added: (holding b267) (clear b48)
   goals met: 1 of 16
6. (putdown b267)
   deleted: (holding b267)
   added: (clear b267) (arm-empty) (on-table b267)
   goals met: 1 of 16
7. (unstack b277 b166)
   deleted: (on b277 b166) (clear b277) (arm-empty)
   added: (holding b277) (clear b166)
   goals met: 1 of 16
8. (putdown b277)
   deleted: (holding b277)
   added: (clear b277) (arm-empty) (on-table b277)
   goals met: 1 of 16
9. (unstack b166 b111)
   deleted: (on b166 b111) (clear b166) (arm-empty)
   added: (holding b166) (clear b111)
   goals met: 1 of 16
10. (putdown b166)
   deleted: (holding b166)
   added: (clear b166) (arm-empty) (on-table b166)
   goals met: 1 of 16
11. (unstack b111 b10)
   deleted: (on b111 b10) (clear b111) (arm-empty)
   added: (holding b111) (clear b10)
   goals met: 1 of 16
12. (putdown b111)
   deleted: (holding b111)
   added: (clear b111) (arm-empty) (on-table b111)
   goals met: 1 of 16
13. (unstack b32 b6)
   deleted: (on b32 b6) (clear b32) (arm-empty)
   added: (holding b32) (clear b6)
   goals met: 2 of 16
14. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 2 of 16
15. (unstack b354 b350)
   deleted: (on b354 b350) (clear b354) (arm-empty)
   added: (holding b354) (clear b350)
   goals met: 2 of 16
16. (putdown b354)
   deleted: (holding b354)
   added: (clear b354) (arm-empty) (on-table b354)
   goals met: 2 of 16
17. (unstack b350 b375)
   deleted: (on b350 b375) (clear b350) (arm-empty)
   added: (holding b350) (clear b375)
   goals met: 2 of 16
18. (putdown b350)
   deleted: (holding b350)
   added: (clear b350) (arm-empty) (on-table b350)
   goals met: 2 of 16
19. (unstack b355 b198)
   deleted: (on b355 b198) (clear b355) (arm-empty)
   added: (holding b355) (clear b198)
   goals met: 2 of 16
20. (putdown b355)
   deleted: (holding b355)
   added: (clear b355) (arm-empty) (on-table b355)
   goals met: 2 of 16
21. (unstack b198 b337)
   deleted: (on b198 b337) (clear b198) (arm-empty)
   added: (holding b198) (clear b337)
   goals met: 2 of 16
22. (putdown b198)
   deleted: (holding b198)
   added: (clear b198) (arm-empty) (on-table b198)
   goals met: 2 of 16
23. (unstack b337 b3)
   deleted: (on b337 b3) (clear b337) (arm-empty)
   added: (holding b337) (clear b3)
   goals met: 2 of 16
24. (putdown b337)
   deleted: (holding b337)
   added: (clear b337) (arm-empty) (on-table b337)
   goals met: 2 of 16
25. (unstack b3 b41)
   deleted: (on b3 b41) (clear b3) (arm-empty)
   added: (holding b3) (clear b41)
   goals met: 2 of 16
26. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 16
27. (unstack b374 b358)
   deleted: (on b374 b358) (clear b374) (arm-empty)
   added: (holding b374) (clear b358)
   goals met: 3 of 16
28. (putdown b374)
   deleted: (holding b374)
   added: (clear b374) (arm-empty) (on-table b374)
   goals met: 3 of 16
29. (unstack b358 b5)
   deleted: (on b358 b5) (clear b358) (arm-empty)
   added: (holding b358) (clear b5)
   goals met: 4 of 16
30. (putdown b358)
   deleted: (holding b358)
   added: (clear b358) (arm-empty) (on-table b358)
   goals met: 4 of 16
31. (unstack b375 b79)
   deleted: (on b375 b79) (clear b375) (arm-empty)
   added: (holding b375) (clear b79)
   goals met: 4 of 16
32. (putdown b375)
   deleted: (holding b375)
   added: (clear b375) (arm-empty) (on-table b375)
   goals met: 4 of 16
33. (unstack b48 b12)
   deleted: (on b48 b12) (clear b48) (arm-empty)
   added: (holding b48) (clear b12)
   goals met: 4 of 16
34. (putdown b48)
   deleted: (holding b48)
   added: (clear b48) (arm-empty) (on-table b48)
   goals met: 4 of 16
35. (unstack b12 b384)
   deleted: (on b12 b384) (clear b12) (arm-empty)
   added: (holding b12) (clear b384)
   goals met: 4 of 16
36. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 5 of 16
37. (unstack b62 b7)
   deleted: (on b62 b7) (clear b62) (arm-empty)
   added: (holding b62) (clear b7)
   goals met: 5 of 16
38. (putdown b62)
   deleted: (holding b62)
   added: (clear b62) (arm-empty) (on-table b62)
   goals met: 5 of 16
39. (unstack b79 b381)
   deleted: (on b79 b381) (clear b79) (arm-empty)
   added: (holding b79) (clear b381)
   goals met: 5 of 16
40. (putdown b79)
   deleted: (holding b79)
   added: (clear b79) (arm-empty) (on-table b79)
   goals met: 5 of 16
41. (unstack b381 b136)
   deleted: (on b381 b136) (clear b381) (arm-empty)
   added: (holding b381) (clear b136)
   goals met: 5 of 16
42. (putdown b381)
   deleted: (holding b381)
   added: (clear b381) (arm-empty) (on-table b381)
   goals met: 5 of 16
43. (unstack b136 b15)
   deleted: (on b136 b15) (clear b136) (arm-empty)
   added: (holding b136) (clear b15)
   goals met: 5 of 16
44. (putdown b136)
   deleted: (holding b136)
   added: (clear b136) (arm-empty) (on-table b136)
   goals met: 5 of 16
45. (unstack b15 b404)
   deleted: (on b15 b404) (clear b15) (arm-empty)
   added: (holding b15) (clear b404)
   goals met: 5 of 16
46. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 5 of 16
47. (unstack b404 b253)
   deleted: (on b404 b253) (clear b404) (arm-empty)
   added: (holding b404) (clear b253)
   goals met: 5 of 16
48. (putdown b404)
   deleted: (holding b404)
   added: (clear b404) (arm-empty) (on-table b404)
   goals met: 5 of 16
49. (unstack b253 b4)
   deleted: (on b253 b4) (clear b253) (arm-empty)
   added: (holding b253) (clear b4)
   goals met: 6 of 16
50. (putdown b253)
   deleted: (holding b253)
   added: (clear b253) (arm-empty) (on-table b253)
   goals met: 6 of 16
51. (unstack b4 b106)
   deleted: (on b4 b106) (clear b4) (arm-empty)
   added: (holding b4) (clear b106)
   goals met: 5 of 16
52. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 7 of 16
53. (unstack b83 b109)
   deleted: (on b83 b109) (clear b83) (arm-empty)
   added: (holding b83) (clear b109)
   goals met: 7 of 16
54. (putdown b83)
   deleted: (holding b83)
   added: (clear b83) (arm-empty) (on-table b83)
   goals met: 7 of 16
55. (unstack b109 b303)
   deleted: (on b109 b303) (clear b109) (arm-empty)
   added: (holding b109) (clear b303)
   goals met: 7 of 16
56. (putdown b109)
   deleted: (holding b109)
   added: (clear b109) (arm-empty) (on-table b109)
   goals met: 7 of 16
57. (unstack b303 b8)
   deleted: (on b303 b8) (clear b303) (arm-empty)
   added: (holding b303) (clear b8)
   goals met: 7 of 16
58. (putdown b303)
   deleted: (holding b303)
   added: (clear b303) (arm-empty) (on-table b303)
   goals met: 7 of 16
59. (unstack b84 b293)
   deleted: (on b84 b293) (clear b84) (arm-empty)
   added: (holding b84) (clear b293)
   goals met: 7 of 16
60. (putdown b84)
   deleted: (holding b84)
   added: (clear b84) (arm-empty) (on-table b84)
   goals met: 7 of 16
61. (unstack b293 b189)
   deleted: (on b293 b189) (clear b293) (arm-empty)
   added: (holding b293) (clear b189)
   goals met: 7 of 16
62. (putdown b293)
   deleted: (holding b293)
   added: (clear b293) (arm-empty) (on-table b293)
   goals met: 7 of 16
63. (unstack b189 b228)
   deleted: (on b189 b228) (clear b189) (arm-empty)
   added: (holding b189) (clear b228)
   goals met: 7 of 16
64. (putdown b189)
   deleted: (holding b189)
   added: (clear b189) (arm-empty) (on-table b189)
   goals met: 7 of 16
65. (unstack b228 b144)
   deleted: (on b228 b144) (clear b228) (arm-empty)
   added: (holding b228) (clear b144)
   goals met: 7 of 16
66. (putdown b228)
   deleted: (holding b228)
   added: (clear b228) (arm-empty) (on-table b228)
   goals met: 7 of 16
67. (unstack b144 b180)
   deleted: (on b144 b180) (clear b144) (arm-empty)
   added: (holding b144) (clear b180)
   goals met: 7 of 16
68. (putdown b144)
   deleted: (holding b144)
   added: (clear b144) (arm-empty) (on-table b144)
   goals met: 7 of 16
69. (unstack b180 b1)
   deleted: (on b180 b1) (clear b180) (arm-empty)
   added: (holding b180) (clear b1)
   goals met: 7 of 16
70. (putdown b180)
   deleted: (holding b180)
   added: (clear b180) (arm-empty) (on-table b180)
   goals met: 7 of 16
71. (unstack b1 b247)
   deleted: (on b1 b247) (clear b1) (arm-empty)
   added: (holding b1) (clear b247)
   goals met: 7 of 16
72. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 8 of 16
73. (unstack b10 b85)
   deleted: (on b10 b85) (clear b10) (arm-empty)
   added: (holding b10) (clear b85)
   goals met: 8 of 16
74. (stack b10 b8)
   deleted: (clear b8) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b8)
   goals met: 9 of 16
75. (unstack b2 b17)
   deleted: (on b2 b17) (clear b2) (arm-empty)
   added: (holding b2) (clear b17)
   goals met: 9 of 16
76. (stack b2 b7)
   deleted: (clear b7) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b7)
   goals met: 10 of 16
77. (unstack b9 b362)
   deleted: (on b9 b362) (clear b9) (arm-empty)
   added: (holding b9) (clear b362)
   goals met: 10 of 16
78. (stack b9 b12)
   deleted: (clear b12) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b12)
   goals met: 11 of 16
79. (unstack b11 b249)
   deleted: (on b11 b249) (clear b11) (arm-empty)
   added: (holding b11) (clear b249)
   goals met: 10 of 16
80. (stack b11 b1)
   deleted: (clear b1) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b1)
   goals met: 12 of 16
81. (unstack b5 b340)
   deleted: (on b5 b340) (clear b5) (arm-empty)
   added: (holding b5) (clear b340)
   goals met: 11 of 16
82. (stack b5 b9)
   deleted: (clear b9) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b9)
   goals met: 13 of 16
83. (unstack b6 b346)
   deleted: (on b6 b346) (clear b6) (arm-empty)
   added: (holding b6) (clear b346)
   goals met: 12 of 16
84. (stack b6 b10)
   deleted: (clear b10) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b10)
   goals met: 14 of 16
85. (unstack b2 b7)
   deleted: (on b2 b7) (clear b2) (arm-empty)
   added: (holding b2) (clear b7)
   goals met: 13 of 16
86. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 13 of 16
87. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 13 of 16
88. (stack b7 b3)
   deleted: (clear b3) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b3)
   goals met: 14 of 16
89. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 14 of 16
90. (stack b2 b7)
   deleted: (clear b7) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b7)
   goals met: 15 of 16
91. (unstack b6 b10)
   deleted: (on b6 b10) (clear b6) (arm-empty)
   added: (holding b6) (clear b10)
   goals met: 13 of 16
92. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 14 of 16
93. (unstack b10 b8)
   deleted: (on b10 b8) (clear b10) (arm-empty)
   added: (holding b10) (clear b8)
   goals met: 13 of 16
94. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 13 of 16
95. (unstack b8 b342)
   deleted: (on b8 b342) (clear b8) (arm-empty)
   added: (holding b8) (clear b342)
   goals met: 13 of 16
96. (stack b8 b2)
   deleted: (clear b2) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b2)
   goals met: 14 of 16
97. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 14 of 16
98. (stack b10 b8)
   deleted: (clear b8) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b8)
   goals met: 15 of 16
99. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 14 of 16
100. (stack b6 b10)
   deleted: (clear b10) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b10)
   goals met: 16 of 16
